app/controllers/authors/pitcures_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	  def set_imagable
	  	@imagable = Author.find(params[:author_id])