app/controllers/books/pitcures_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	  def set_imagable
	  	@imagable = Book.find(params[:book_id])