app/views/books/_form.html.erb

    <%= form.label :author %>
    <%= collection_select(:book, :author_id, Author.all, :id,:name,prompt: true) %>
---
SELECT "authors".* FROM "authors"