app/controllers/books_controller.rb

INSERT INTO "books" ("title", "content", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "content" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    respond_to do |format|
      if @book.update(book_params)