app/controllers/pitcures_controller.rb

	def create
		@pitcure = @imagable.pitcures.new(pitcure_params)
		@imagable.save
---
INSERT INTO "pitcures" ("imagable_type", "imagable_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imagable_type", "Author"], ["imagable_id", 1], ["image", "download.jpeg"], ["created_at", "2021-07-27 07:41:51.679161"], ["updated_at", "2021-07-27 07:41:51.679161"]]