app/controllers/reviews_controller.rb

  def create

    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("name", "review", "book_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "james"], ["review", "dddddddddd"], ["book_id", 1], ["author_id", 1], ["created_at", "2021-07-21 11:48:00.897657"], ["updated_at", "2021-07-21 11:48:00.897657"]]