app/views/reviews/_form.html.erb

SELECT "books".* FROM "books"
---
    <%= form.label :book %>
    <%= collection_select(:review, :book_id, Book.all, :id,:title,prompt: true) %>

SELECT "authors".* FROM "authors"
---
    <%= form.label :author %>
    <%= collection_select(:review, :author_id, Author.all, :id,:name,prompt: true) %>